export const AMO = {
  CUSTOM_FIELD: {
    /* --------------------------------- Основное ------------------------------- */
    DATE: 1369498, // Дата
    /* ---------------------------------- Заказ --------------------------------- */
    ORDER_ID: 1366662, // Номер заказа
    PREPAY: 1376228, // Предоплата
    FULLPAY: 1997465, // Полная оплата
    PAY_TYPE: 1376058, // Тип оплаты
    DISCOUNT: 1376070, // Скидка
    DELIVERY_TIME: 1376026, // Время доставки
    COMMENT_CLIENT: 1340240, // Комментарий клиента
    COMMENT_MANAGER: 1376098, // Комментарий менеджера
    /* -------------------------------- Доставка -------------------------------- */
    DELIVERY_TYPE: 1337998, // Тип доставки
    DELIVERY_COST: 1334194, // Стоимость доставки
    INDEX: 1454436, // Адрес, индекс
    CITY: 1369856, // Адрес, города
    STREET: 1369858, // Адрес, улица
    BUILDING: 1454432, // Адрес, дом
    FLAT: 1454434, // Адрес, квартира
    TRACK_NUMBER: 1430854, // Трек-код
    DELIVERY_TARIFF: 2114845, // Тариф
    PVZ: 2114847, // ПВЗ
    /* ---------------------------------- СДЭК ---------------------------------- */
    CDEK_CITY_ID: 1413328, // СДЭК, город id
    CDEK_DELIVERY_DATE: 1413332, // СДЭК, дата отправки
    CDEK_UUID: 1997423, // СДЭК, uuid
    CDEK_INVOICE_URL: 1997427, // СДЭК, накладная
    CDEK_STATUS: 1997433, // СДЭК, последний статус
    CDEK_PREIOD: 1997435, // СДЭК, сроки доставки
    CDEK_COMMENT: 1997537, // СДЭК, комментарий для курьера
    CDEK_RETURN_UUID: 2145715, // СДЭК, возврат uuid
    CDEK_RETURN_INVOICE: 2115157, // СДЭК, возврат накладная
    CDEK_RETURN_PRICE: 2115159, // СДЭК, возврат стоимость
    /* ----------------------------- Вызов Курьера ----------------------------- */
    COURIER_PICKUP_DATE: 2114839, // Вызов курьера
    COURIER_CALLED: 2114837, // Курьер вызван
    COURIER_PICKUP_TIME: 2115965, // Время забора с
  },
  /* ------------------------------ Поля контакта ----------------------------- */
  CONTACT: {
    PHONE: 1305898, // Контакт, телефон
    EMAIL: 1305900, // Контакт, почта
  },
  /* ----------------------------- Статусы воронки ---------------------------- */
  STATUS: {
    CLAIM: 12470886, // Заявка
    REQUISITE: 12601569, // Реквизиты
    PAYMENT: 12528897, // Отплаты
    DELIVERY: 12470889, // Доставка
    POST: 12470892, // Почта
    CDEK: 12470895, // СДЭК
    VISIT: 12523860, // Визиты
    SENT: 12601911, // Отправлено
    SUCCESS: 142, // Успешно реализовано
    CLOSED: 143, // Закрыто и не реализовано
    RETURN: 30999157, // Возвраты
  },
  /* ---------------------------------- Тэги ---------------------------------- */
  TAG: {
    SITE: 92650, // с стайта
    CALL_REQUEST: 683220, // Заказ зввонка
    RETURN: 732639, // возврат
    PARTIAL_RETURN: 735999, // частичный возврат
  },
  /* ------------------------------ Пользователи ------------------------------ */
  USER: {
    ADMIN: 1092156, // Меховой салон GERDA
    EKATERINA: 1109421, // Екатерина
    OLGA: 1110687, // Ольга
  },
  /* -------------------------------- Каталоги -------------------------------- */
  CATALOG: {
    GOODS: 3272, // Список товаров
    CUSTOM_FIELD: {
      SKU: 1434478, // Артикул
      PRICE: 1434482, // Цена
      WEIGHT: 1457696, // Вес
      QUANTITY: 1434480, // Количество
    },
  },
  /* --------------------------------- Воронки -------------------------------- */
  PIPELINE: {
    MAIN: 311787, // Основная воронка
    RETURN: 2217028, // Возвраты
  },
  /* --------------------------------- Задачи --------------------------------- */
  TASK: {
    CALL: 1, // Связаться с клиентом
    PROCESS: 1746622, // Обработать
    ERROR: 1743178, // Ошибка
    EMAIL: 1604317, // Написать письмо
    RECALL: 1363711, // Повторный звонок
  },
  /* ----------------------------- Причина отказа ----------------------------- */
  LOSS_REASON: {
    REFUSED: 1730713, // Отказ
    NO_GOODS: 1730698, // Товар отсутствует
    CLIENT_NOT_REACHEABLE: 1730707, // Не удалось связаться с клиентом
    RETURN: 1730710, // Возврат
    CDEK_RETURN: 16603846, // СДЭК Возврат
    CDEK_PARTIAL_RETURN: 16603686, //СДЭК Частичный выкуп
    DOUBLED: 16603754, // Дубликат
  },
} as const;
